```
[command]/usr/local/vss-agent/2.308.0/_work/_temp/cbc475ea-f425-4eb5-be30-ca14e72b1df0/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.oneespool["https://github.com/lonegunmanb/terraform-azurerm-aks"] will be created
  + resource "azapi_resource" "oneespool" {
      + body                      = jsonencode(
            {
              + properties = {
                  + agentProfile         = {
                      + type = "Stateless"
                    }
                  + images               = [
                      + {
                          + imageName            = "ghrunner"
                          + poolBufferPercentage = "100"
                          + subscriptionId       = "f7a632a5-49db-4c5e-9828-cd62cb753971"
                        },
                    ]
                  + maxPoolSize          = 3
                  + networkProfile       = {
                      + natGatewayIpAddressCount = 1
                    }
                  + organizationProfile  = {
                      + type = "GitHub"
                      + url  = "https://github.com/lonegunmanb/terraform-azurerm-aks"
                    }
                  + sku                  = {
                      + enableSpot = false
                      + name       = "Standard_D2ds_v4"
                      + tier       = "StandardSSD"
                    }
                  + vmProvider           = "Azure"
                  + vmProviderProperties = {
                      + VssAdminPermissions = "CreatorOnly"
                    }
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "terraform-azurerm-aks-lonegunman"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/1esrunner"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + tags                      = {
          + "repo_url" = "https://github.com/lonegunmanb/terraform-azurerm-aks"
        }
      + type                      = "Microsoft.CloudTest/hostedpools@2020-05-07"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "10m"
        }
    }

  # azapi_update_resource.identity["https://github.com/lonegunmanb/terraform-azurerm-aks"] will be created
  + resource "azapi_update_resource" "identity" {
      + body                    = jsonencode(
            {
              + identity = {
                  + type                   = "UserAssigned"
                  + userAssignedIdentities = {
                      + "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/1es-runner-identity/providers/Microsoft.ManagedIdentity/userAssignedIdentities/runner" = {}
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.CloudTest/hostedpools@2020-05-07"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azapi_resource.oneespool["https://github.com/lonegunmanb/terraform-azurerm-aks"] will be created%0A  + resource "azapi_resource" "oneespool" {%0A      + body                      = jsonencode(%0A            {%0A              + properties = {%0A                  + agentProfile         = {%0A                      + type = "Stateless"%0A                    }%0A                  + images               = [%0A                      + {%0A                          + imageName            = "ghrunner"%0A                          + poolBufferPercentage = "100"%0A                          + subscriptionId       = "f7a632a5-49db-4c5e-9828-cd62cb753971"%0A                        },%0A                    ]%0A                  + maxPoolSize          = 3%0A                  + networkProfile       = {%0A                      + natGatewayIpAddressCount = 1%0A                    }%0A                  + organizationProfile  = {%0A                      + type = "GitHub"%0A                      + url  = "https://github.com/lonegunmanb/terraform-azurerm-aks"%0A                    }%0A                  + sku                  = {%0A                      + enableSpot = false%0A                      + name       = "Standard_D2ds_v4"%0A                      + tier       = "StandardSSD"%0A                    }%0A                  + vmProvider           = "Azure"%0A                  + vmProviderProperties = {%0A                      + VssAdminPermissions = "CreatorOnly"%0A                    }%0A                }%0A            }%0A        )%0A      + id                        = (known after apply)%0A      + ignore_casing             = false%0A      + ignore_missing_property   = true%0A      + location                  = "eastus"%0A      + name                      = "terraform-azurerm-aks-lonegunman"%0A      + output                    = (known after apply)%0A      + parent_id                 = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/1esrunner"%0A      + removing_special_chars    = false%0A      + schema_validation_enabled = false%0A      + tags                      = {%0A          + "repo_url" = "https://github.com/lonegunmanb/terraform-azurerm-aks"%0A        }%0A      + type                      = "Microsoft.CloudTest/hostedpools@2020-05-07"%0A%0A      + timeouts {%0A          + create = "30m"%0A          + delete = "30m"%0A          + read   = "10m"%0A        }%0A    }%0A%0A  # azapi_update_resource.identity["https://github.com/lonegunmanb/terraform-azurerm-aks"] will be created%0A  + resource "azapi_update_resource" "identity" {%0A      + body                    = jsonencode(%0A            {%0A              + identity = {%0A                  + type                   = "UserAssigned"%0A                  + userAssignedIdentities = {%0A                      + "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/1es-runner-identity/providers/Microsoft.ManagedIdentity/userAssignedIdentities/runner" = {}%0A                    }%0A                }%0A            }%0A        )%0A      + id                      = (known after apply)%0A      + ignore_casing           = false%0A      + ignore_missing_property = true%0A      + name                    = (known after apply)%0A      + output                  = (known after apply)%0A      + parent_id               = (known after apply)%0A      + resource_id             = (known after apply)%0A      + type                    = "Microsoft.CloudTest/hostedpools@2020-05-07"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```